#### Terraform Plan 📖
**Environment:** `dev`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg]
module.postgresql[0].azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flowpost-dev-postgres]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.backend.azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "flowpost-dev-backend"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "flowpost-dev-rg"
      + revision_mode                 = "Multiple"
      + tags                          = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 54367
          + transport                  = "http"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "registry-password"
          + server               = (known after apply)
          + username             = (known after apply)
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = (known after apply)
              + memory            = "1Gi"
              + name              = "flowpost-dev-backend"

              + env {
                  + name  = "AI_PROVIDER"
                  + value = "gemini"
                }
              + env {
                  + name  = "HOST"
                  + value = "0.0.0.0"
                }
              + env {
                  + name  = "IMAGE_MODEL"
                  + value = "gemini-2.5-flash-image"
                }
              + env {
                  + name  = "LLM_MODEL"
                  + value = "gemini-2.5-flash"
                }
              + env {
                  + name  = "NODE_ENV"
                  + value = "development"
                }
              + env {
                  + name  = "PORT"
                  + value = "54367"
                }
              + env {
                  + name        = "DATABASE_URI"
                  + secret_name = "database-uri"
                }
              + env {
                  + name        = "FIRECRAWL_API_KEY"
                  + secret_name = "firecrawl-api-key"
                }
              + env {
                  + name        = "GEMINI_API_KEY"
                  + secret_name = "gemini-api-key"
                }
              + env {
                  + name        = "LANGCHAIN_API_KEY"
                  + secret_name = "langchain-api-key"
                }
              + env {
                  + name        = "OPENAI_API_KEY"
                  + secret_name = "openai-api-key"
                }
              + env {
                  + name        = "SERPER_API_KEY"
                  + secret_name = "serper-api-key"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 1
                  + interval_seconds                 = 30
                  + path                             = "/health/live"
                  + port                             = 54367
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 5
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + interval_seconds        = 10
                  + path                    = "/health/ready"
                  + port                    = 54367
                  + success_count_threshold = 1
                  + timeout                 = 5
                  + transport               = "HTTP"
                }

              + startup_probe {
                  + failure_count_threshold          = 30
                  + interval_seconds                 = 10
                  + path                             = "/health/startup"
                  + port                             = 54367
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 5
                  + transport                        = "HTTP"
                }
            }

          + http_scale_rule {
              + concurrent_requests = "50"
              + name                = "http-scaling"
            }
        }
    }

  # module.container_environment.azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "centralus"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "flowpost-dev-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "flowpost-dev-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }
      + zone_redundancy_enabled          = false
    }

  # module.container_environment.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "centralus"
      + name                            = "flowpost-dev-env-logs"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "flowpost-dev-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }
      + workspace_id                    = (known after apply)
    }

  # module.container_environment.time_sleep.wait_for_log_analytics will be created
  + resource "time_sleep" "wait_for_log_analytics" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.container_registry.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "centralus"
      + login_server                  = (known after apply)
      + name                          = "flowpostdevacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "flowpost-dev-rg"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.frontend.azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "flowpost-dev-frontend"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "flowpost-dev-rg"
      + revision_mode                 = "Multiple"
      + tags                          = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 3000
          + transport                  = "http"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "registry-password"
          + server               = (known after apply)
          + username             = (known after apply)
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = (known after apply)
              + memory            = "0.5Gi"
              + name              = "flowpost-dev-frontend"

              + env {
                  + name  = "HOSTNAME"
                  + value = "0.0.0.0"
                }
              + env {
                  + name  = "LANGGRAPH_API_URL"
                  + value = (known after apply)
                }
              + env {
                  + name  = "NEXT_PUBLIC_CLERK_AFTER_SIGN_IN_URL"
                  + value = "/dashboard"
                }
              + env {
                  + name  = "NEXT_PUBLIC_CLERK_AFTER_SIGN_UP_URL"
                  + value = "/dashboard"
                }
              + env {
                  + name  = "NEXT_PUBLIC_CLERK_SIGN_IN_URL"
                  + value = "/sign-in"
                }
              + env {
                  + name  = "NEXT_PUBLIC_CLERK_SIGN_UP_URL"
                  + value = "/sign-up"
                }
              + env {
                  + name  = "NODE_ENV"
                  + value = "production"
                }
              + env {
                  + name  = "PORT"
                  + value = "3000"
                }
              + env {
                  + name        = "ADMIN_USER_IDS"
                  + secret_name = "admin-user-ids"
                }
              + env {
                  + name        = "CLERK_SECRET_KEY"
                  + secret_name = "clerk-secret-key"
                }
              + env {
                  + name        = "NEXT_PUBLIC_CLERK_PUBLISHABLE_KEY"
                  + secret_name = "clerk-publishable-key"
                }
              + env {
                  + name        = "PERPLEXITY_API_KEY"
                  + secret_name = "perplexity-api-key"
                }
              + env {
                  + name        = "SERPER_API_KEY"
                  + secret_name = "serper-api-key"
                }
              + env {
                  + name        = "STRIPE_SECRET_KEY"
                  + secret_name = "stripe-secret-key"
                }
              + env {
                  + name        = "STRIPE_WEBHOOK_SECRET"
                  + secret_name = "stripe-webhook-secret"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 1
                  + interval_seconds                 = 30
                  + path                             = "/api/health/live"
                  + port                             = 3000
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 5
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + interval_seconds        = 10
                  + path                    = "/api/health/ready"
                  + port                    = 3000
                  + success_count_threshold = 1
                  + timeout                 = 5
                  + transport               = "HTTP"
                }

              + startup_probe {
                  + failure_count_threshold          = 24
                  + interval_seconds                 = 5
                  + path                             = "/api/health/startup"
                  + port                             = 3000
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 5
                  + transport                        = "HTTP"
                }
            }

          + http_scale_rule {
              + concurrent_requests = "50"
              + name                = "http-scaling"
            }
        }
    }

  # module.key_vault[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = false
      + enabled_for_disk_encryption   = false
      + id                            = (known after apply)
      + location                      = "centralus"
      + name                          = "flowpostdevkv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "flowpost-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }
      + tenant_id                     = (known after apply)
      + vault_uri                     = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_access_policy.terraform[0] will be created
  + resource "azurerm_key_vault_access_policy" "terraform" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Create",
          + "Delete",
          + "Get",
          + "List",
          + "Update",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.acr_password[0] will be created
  + resource "azurerm_key_vault_secret" "acr_password" {
      + content_type            = "Azure Container Registry Password"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "acr-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.admin_user_ids[0] will be created
  + resource "azurerm_key_vault_secret" "admin_user_ids" {
      + content_type            = "Admin User IDs (comma-separated)"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "admin-user-ids"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.clerk_publishable_key[0] will be created
  + resource "azurerm_key_vault_secret" "clerk_publishable_key" {
      + content_type            = "Clerk Publishable Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "clerk-publishable-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.clerk_secret_key[0] will be created
  + resource "azurerm_key_vault_secret" "clerk_secret_key" {
      + content_type            = "Clerk Secret Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "clerk-secret-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.database_uri[0] will be created
  + resource "azurerm_key_vault_secret" "database_uri" {
      + content_type            = "PostgreSQL Connection URI"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "database-uri"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.firecrawl_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "firecrawl_api_key" {
      + content_type            = "FireCrawl API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "firecrawl-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.gemini_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "gemini_api_key" {
      + content_type            = "Google Gemini API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "gemini-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.openai_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "openai_api_key" {
      + content_type            = "OpenAI API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "openai-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.perplexity_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "perplexity_api_key" {
      + content_type            = "Perplexity API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "perplexity-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.postgres_admin[0] will be created
  + resource "azurerm_key_vault_secret" "postgres_admin" {
      + content_type            = "PostgreSQL Admin Username"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgres-admin"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.postgres_host[0] will be created
  + resource "azurerm_key_vault_secret" "postgres_host" {
      + content_type            = "PostgreSQL Host"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgres-host"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.postgres_password[0] will be created
  + resource "azurerm_key_vault_secret" "postgres_password" {
      + content_type            = "PostgreSQL Admin Password"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgres-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.serper_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "serper_api_key" {
      + content_type            = "Serper API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "serper-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.stripe_secret_key[0] will be created
  + resource "azurerm_key_vault_secret" "stripe_secret_key" {
      + content_type            = "Stripe Secret Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "stripe-secret-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.stripe_webhook_secret[0] will be created
  + resource "azurerm_key_vault_secret" "stripe_webhook_secret" {
      + content_type            = "Stripe Webhook Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "stripe-webhook-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.this will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "this" {
      ~ administrator_password        = (sensitive value)
        id                            = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flowpost-dev-postgres"
        name                          = "flowpost-dev-postgres"
        tags                          = {
            "AutoDeploy"  = "true"
            "CostCenter"  = "development"
            "Criticality" = "low"
            "Environment" = "dev"
            "Lifecycle"   = "development"
            "ManagedBy"   = "terraform"
            "Project"     = "flowpost"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.connection_throttling will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "connection_throttling" {
      + id        = (known after apply)
      + name      = "connection_throttle.enable"
      + server_id = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flowpost-dev-postgres"
      + value     = "on"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.extensions will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flowpost-dev-postgres"
      + value     = "PGCRYPTO,UUID-OSSP"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.log_checkpoints will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "log_checkpoints" {
      + id        = (known after apply)
      + name      = "log_checkpoints"
      + server_id = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flowpost-dev-postgres"
      + value     = "on"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.this will be created
  + resource "azurerm_postgresql_flexible_server_database" "this" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "flowpost_dev_db"
      + server_id = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flowpost-dev-postgres"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.azure_services[0] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/flowpost-dev-postgres"
      + start_ip_address = "0.0.0.0"
    }

Plan: 28 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + backend_url                     = (known after apply)
  ~ container_registry_login_server = "flowpostdevacr.azurecr.io" -> (known after apply)
  + frontend_url                    = (known after apply)
  + key_vault_uri                   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @Abby263, Action: `pull_request`*